
## Plan Result (prod)




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule"
      ~ start_time              = "2024-10-29T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rl-schedule-single-trigger"
      ~ start_time              = "2024-10-28T13:32:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule"
      ~ start_time              = "2024-10-29T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Automation/automationAccounts/hmi-prod-aa/schedules/rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisaprod-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2024-10-28T13:32:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sa.azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Storage/storageAccounts/hmisaprod/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-sharedinfra-sds-prod-rg/providers/Microsoft.Storage/storageAccounts/hmisaprod"
        name                               = "hmisaprod"
        tags                               = {
            "application"         = "hearings-management-interface"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "production"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (95 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->